In [1]:
%matplotlib inline
import pandas as pd

In [2]:
titles = pd.read_csv('./titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [3]:
titles.describe()

                year
count  244914.000000
mean     1986.616012
std        29.459912
min      1894.000000
25%      1967.000000
50%      1997.000000
75%      2012.000000
max      2115.000000

### How many movies are listed in the titles dataframe?

In [4]:
print("The total number of movies listed in the dataframe are: ", titles.shape[0])

The total number of movies listed in the dataframe are:  244914

In [5]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244914 entries, 0 to 244913
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   244914 non-null  object
 1   year    244914 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.7+ MB

### What are the earliest two films listed in the titles dataframe?

In [6]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

In [7]:
print(titles["year"].sort_values())
print("\n \nThe first movie was ",titles["title"][193222], "1894")
print("\n\nThe second movie was", titles["title"][51388], "1898")

193222    1894
51388     1898
4584      1899
219198    1900
47548     1900
          ...
217349    2024
178993    2024
34213     2025
183018    2026
242196    2115
Name: year, Length: 244914, dtype: int64


The first movie was  Miss Jerry 1894


The second movie was The Startled Lover 1898

### How many movies have the title "Hamlet"?

In [8]:
count = 0
for i in titles["title"]:
    if "Hamlet" in i:
        count = count +1
        print(i)
print ("\n\nThe total number of movies having 'Hamlet' in their title is ", count)

Hamlet
Hamlet
Hamlet
Zombie Hamlet
Han, hun og Hamlet
Green Eggs and Hamlet
Hamlet: The Fall of a Sparrow
Hamlet, Prince of Denmark
Hamlet liikemaailmassa
Hamlet
Hamlet
Hamlet
Hamlet
National Theatre Live: Hamlet
Hamlet_X
Hamlet
Royal Shakespeare Company: Hamlet
Hamlet (II)
Han, hun og Hamlet
The Tragedy of Hamlet Prince of Denmark
Hamlet
Hamlet Unbound
Hamlet: Prince of Denmark
Hamlet's Ghost
Dogg's Hamlet, Cahoot's Macbeth
Hamlet
Harry, Hamlet and I
Hamlet
Hamlet (II)
Hamlet, Son of a Kingpin
Predstava 'Hamleta' u Mrdusi Donjoj
Hamlet
Kitchen Hamlet
Hamlet
Hamlet
Hamlet
Hamlet (II)
Hamlet 2
Hamlet
Hamlet (II)
Hamlet A.D.D.
Hamlet in the Golden Vale
Hamlet
Hamlet the Vampire Slayer
Hamlet
Hamlet Demonstration
Hamlet
Hamlet X
Hamlet (III)
Fuck Hamlet
Hamlet
A Sagebrush Hamlet
H for Hamlet
Hamlet in the Hamptons
Intikam Melegi/Kadin Hamlet
Hamlet/Horatio
Hamlet (II)


The total number of movies having 'Hamlet' in their title is  57

In [9]:
count = 0
for i in titles["title"]:
    if i == "Hamlet":
        count = count +1
        
print ("The total number of movies named Hamlet are ", count)

The total number of movies named Hamlet are  20

In [10]:
titles.loc[lambda titles: titles['title'] == "Hamlet", :]

         title  year
6422    Hamlet  2017
10637   Hamlet  1921
39916   Hamlet  1913
52521   Hamlet  1910
62000   Hamlet  2000
67406   Hamlet  1969
82130   Hamlet  1987
88065   Hamlet  2016
101728  Hamlet  1948
122827  Hamlet  1973
133921  Hamlet  1976
154029  Hamlet  2015
161324  Hamlet  1964
172640  Hamlet  1954
173033  Hamlet  2011
178222  Hamlet  1996
189093  Hamlet  2009
192142  Hamlet  1990
198234  Hamlet  1911
202025  Hamlet  2014

### How many movies are titled "North by Northwest"?

In [11]:
count = 0
for i in titles["title"]:
    if "North by Northwest" in i:
        count = count +1
        
print("Only ",count, " movie is titles 'North by Northwest'")

Only  1  movie is titles 'North by Northwest'

### When was the first movie titled "Hamlet" made?

In [12]:
ham = titles.loc[lambda titles: titles['title'] == "Hamlet", :]
ham.sort_values("year").head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [13]:
titles[titles["title"].str.contains("Treasure Island")].sort_values("year")

                                                    title  year
55686                                     Treasure Island  1918
196514                                    Treasure Island  1920
141822                                    Treasure Island  1934
64173                       The Secret of Treasure Island  1938
79701                     Charlie Chan at Treasure Island  1939
77354                                     Treasure Island  1950
34341                           Return to Treasure Island  1954
34288                           Five on a Treasure Island  1957
65051                                     Treasure Island  1972
37238                                     Treasure Island  1973
173051                                    Treasure Island  1985
26111                              Muppet Treasure Island  1996
27076                                     Treasure Island  1999
216970                               Treasure Island (II)  1999
209707  Treasure Island Kids: The Battle of Treasure I...  2006
2830                           Pirates of Treasure Island  2006
112591  Treasure Island Kids: The Mystery of Treasure ...  2006
244541  Treasure Island Kids: The Monster of Treasure ...  2006
155317             National Theatre Live: Treasure Island  2015

### How many movies were made in the year 1950?

In [14]:
count = 0
for i in titles["year"]:
    if i == 1950:
        count = count + 1
print("The total number of movies made in 1950 are ", count)

The total number of movies made in 1950 are  1113

In [15]:
titles.loc[lambda titles: titles['year'] == 1950, :].shape[0]

1113

### How many movies were made in the year 1960?

In [16]:
count = 0
for i in titles["year"]:
    if i == 1960:
        count = count + 1
print("The total number of movies made in 1950 are ", count)

The total number of movies made in 1950 are  1549

In [17]:
titles.loc[lambda titles: titles['year'] == 1960, :].shape[0]

1549

### How many movies were made from 1950 through 1959?

In [18]:
count = 0
for i in titles["year"]:
    if i in range(1950,1960):
        count = count + 1
print("The total number of movies made between 1950 and 1960 are ", count)

The total number of movies made between 1950 and 1960 are  12934

### In what years has a movie titled "Batman" been released?

In [19]:
tb = titles.loc[lambda titles: titles['title'] == "Batman", :]
tb = tb.iloc[:,1:2]
tb.sort_values("year")

        year
39349   1943
240896  1989

### How many roles were there in the movie "Inception"?

In [20]:
cast = pd.read_csv('./cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [24]:
rd = pd.read_csv('./release_dates.csv')
rd.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [29]:
tb = cast.loc[lambda cast: cast['title'] == "Inception", :]
print("There are ",tb.shape[0], " roles in the movie Inception")
tb

There are  78  roles in the movie Inception

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3387147,Inception,2010,Ellen Page,actress,Ariadne,3.0
3444628,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3473041,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3480170,Inception,2010,Talulah Riley,actress,Blonde,25.0
3731263,Inception,2010,Shannon Welles,actress,Old Mal,51.0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [34]:
print("The number of roles in the movie Inception that were not ranked by an n value are",tb.isna().sum().sum())

The number of roles in the movie Inception that were not ranked by an n value are 27

In [59]:
tb.isna().sum()

title         0
year          0
name          0
type          0
character     0
n            27
dtype: int64

### But how many roles in the movie "Inception" did receive an "n" value?

In [61]:
print(tb.shape[0] - tb.isna().sum().sum(), " Roles in the movie have received an n value")

51  Roles in the movie have received an n value

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [66]:
nbn = cast.loc[lambda cast: cast['title'] == "North by Northwest", :]
nbn = nbn.sort_values("n")
print(nbn.isna().sum())
nbn = nbn.iloc[:(nbn.shape[0]-nbn.isna().sum().sum()),:]
nbn

title          0
year           0
name           0
type           0
character      0
n            100
dtype: int64

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [56]:
sl = cast.loc[lambda cast: cast['title'] == "Sleuth", :]
sl = sl.loc[lambda sl: sl['year'] == 1972, :]
sl.sort_values('n')

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [62]:
sl = cast.loc[lambda cast: cast['title'] == "Sleuth", :]
sl = sl.loc[lambda sl: sl['year'] == 2007, :]
sl.sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

In [89]:
cast.isna().sum()

title              0
year               0
name               0
type               0
character          0
n            1458573
dtype: int64

### How many roles were credited in the silent 1921 version of Hamlet?

In [70]:
ha = cast.loc[lambda cast: cast['title'] == "Hamlet", :]
ha = ha.loc[lambda ha: ha['year'] == 1921, :]

In [86]:
print("The number of roles credited in Hamlet 1921 are ", ha.shape[0])

The number of roles credited in Hamlet 1921 are  9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [83]:
hb = cast.loc[lambda cast: cast['title'] == "Hamlet", :]
hb = hb.loc[lambda hb: hb['year'] == 1996, :]

In [85]:
hb.sort_values('n')

,title,year,name,type,character,n
1731,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
95861,Hamlet,1996,Richard Attenborough,actor,English Ambassador,2.0
214473,Hamlet,1996,David (V) Blair,actor,Attendant to Claudius,3.0
219554,Hamlet,1996,Brian Blessed,actor,Ghost of Hamlet's Father,4.0
260225,Hamlet,1996,Kenneth Branagh,actor,Hamlet,5.0
272749,Hamlet,1996,Richard Briers,actor,Polonius,6.0
294652,Hamlet,1996,Michael Bryant,actor,Priest,7.0
319501,Hamlet,1996,Peter Bygott,actor,Attendant to Claudius,8.0
2737885,Hamlet,1996,Julie Christie,actress,Gertrude,9.0
500916,Hamlet,1996,Billy Crystal,actor,First Gravedigger,10.0
518572,Hamlet,1996,Charles Daish,actor,Stage Manager,11.0
2814220,Hamlet,1996,Judi Dench,actress,Hecuba,12.0
576147,Hamlet,1996,G?rard Depardieu,actor,Reynaldo,13.0
598618,Hamlet,1996,Reece Dinsdale,actor,Guildenstern,14.0
604339,Hamlet,1996,Ken Dodd,actor,Yorick,15.0
2835947,Hamlet,1996,Angela Douglas,actress,Attendant to Gertrude,16.0
656817,Hamlet,1996,Rob Edwards,actor,Lucianus,17.0
704270,Hamlet,1996,Nicholas Farrell,actor,Horatio,18.0
708468,Hamlet,1996,Ray Fearon,actor,Francisco,19.0
2940033,Hamlet,1996,Yvonne Gidden,actress,Doctor,20.0
827066,Hamlet,1996,John Gielgud,actor,Priam,21.0
2999610,Hamlet,1996,Rosemary Harris,actress,Player Queen,22.0
990819,Hamlet,1996,Charlton Heston,actor,Player King,23.0
1074691,Hamlet,1996,Ravil Isyanov,actor,Cornelius,24.0
1082161,Hamlet,1996,Derek Jacobi,actor,Claudius,25.0
3119901,Hamlet,1996,Rowena King,actress,Attendant to Gertrude,26.0
1210509,Hamlet,1996,Jeffery Kissoon,actor,Fortinbras's Captain,27.0
3154270,Hamlet,1996,Sarah Lam,actress,Attendant to Gertrude,28.0
1316617,Hamlet,1996,Jack Lemmon,actor,Marcellus,29.0
1489191,Hamlet,1996,Ian McElhinney,actor,Barnardo,30.0
1417360,Hamlet,1996,Michael Maloney,actor,Laertes,31.0
2154960,Hamlet,1996,John Spencer-Churchill,actor,Fortinbras's Captain,32.0
1549128,Hamlet,1996,John Mills,actor,Old Norway,33.0
1556082,Hamlet,1996,Jimi Mistry,actor,Sailor Two,34.0
3451003,Hamlet,1996,Sian Radinger,actress,Prologue,35.0
158642,Hamlet,1996,Simon Russell Beale,actor,Second Gravedigger,37.0
2040040,Hamlet,1996,Andrew Schofield,actor,Young Lord,38.0
2067657,Hamlet,1996,Rufus Sewell,actor,Fortinbras,39.0
2151526,Hamlet,1996,Timothy Spall,actor,Rosencrantz,40.0
2221910,Hamlet,1996,Thomas Szekeres,actor,Young Hamlet,41.0
2259675,Hamlet,1996,Ben Thom,actor,First Player,42.0
2404091,Hamlet,1996,Don Warrington,actor,Voltimand,43.0
3728751,Hamlet,1996,Perdita Weeks,actress,Second Player,44.0
2453099,Hamlet,1996,Robin Williams,actor,Osric,45.0
3751232,Hamlet,1996,Kate Winslet,actress,Ophelia,46.0
2500066,Hamlet,1996,David Yip,actor,Sailor One,47.0
250773,Hamlet,1996,Christopher Bowles,actor,Cadet in Play,NaN
344365,Hamlet,1996,Kenneth W Caravan,actor,Laertes Mob,NaN
669232,Hamlet,1996,Jimmy Ellis,actor,Old Fortinbras,NaN
1400732,Hamlet,1996,Anthony Maddalena,actor,Elsinore Courtier,NaN
1588218,Hamlet,1996,Frank (II) Morgan,actor,Pyrrhus,NaN
2052796,Hamlet,1996,Orlando Seale,actor,Boatman,NaN
2508377,Hamlet,1996,Jimmy Yuill,actor,Alexander,NaN
3456114,Hamlet,1996,Melanie Ramsay,actress,Prostitute,NaN

In [132]:
print("The number of roles credited in Hamlet 1921 are  ", hb.shape[0])
print("The number of roles credited in Hamlet 1921 (without n value) are  ", hb.shape[0] - hb.isna().sum().sum())

The number of roles credited in Hamlet 1921 are   54
The number of roles credited in Hamlet 1921 (without n value) are   46

### How many "Hamlet" roles have been listed in all film credits through history?

In [90]:
hc =cast.loc[lambda cast: cast['title'] == "Hamlet", :]

In [131]:
print("The total number of roles listed are ", hc.shape[0])

print("The total number of roles listed are (without n value) ", hc.shape[0] - hc.isna().sum().sum())

The total number of roles listed are  342
The total number of roles listed are (without n value)  249

### How many people have played an "Ophelia"?

In [94]:
op = cast.loc[lambda cast: cast['character'] == "Ophelia", :]

In [98]:
print(op.shape[0], "people have played an Ophelia")

117 people have played an Ophelia

### How many people have played a role called "The Dude"?

In [99]:
du = cast.loc[lambda cast: cast['character'] == "The Dude", :]

In [100]:
print(du.shape[0], "people have played The Dude")

19 people have played The Dude

### How many people have played a role called "The Stranger"?

In [101]:
st = cast.loc[lambda cast: cast['character'] == "The Stranger", :]

In [102]:
print(st.shape[0], "people have played The Stranger")

212 people have played The Stranger

### How many roles has Sidney Poitier played throughout his career?

In [112]:
sp = cast.loc[lambda cast: cast['name'] == "Sidney Poitier", :]

In [113]:
print("Sidney Poitier has played",sp.shape[0], "roles in his career")

Sidney Poitier has played 43 roles in his career

### How many roles has Judi Dench played?

In [114]:
jd = cast.loc[lambda cast: cast['name'] == "Judi Dench", :]

In [116]:
print("Judi Dench has played",jd.shape[0], "roles in his career")

Judi Dench has played 55 roles in his career

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [148]:
cg = cast.loc[(cast['year'] >= 1940) & (cast['year'] < 1950) & (cast['n'] == 2) & (cast['name'] == 'Cary Grant')]

In [149]:
cg.sort_values('year')

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [150]:
cg1 = cast.loc[(cast['year'] >= 1940) & (cast['year'] < 1950) & (cast['n'] == 1) & (cast['name'] == 'Cary Grant')]
cg1.sort_values('year')

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [142]:
ro = cast.loc[(cast['year'] >= 1950) & (cast['year'] <= 1960)]

In [145]:
ro = ro.loc[lambda ro: ro['type'] == 'actor', :]
print(ro.shape[0], "roles were available for actors")

171302 roles were available for actors

### How many roles were available for actresses in the 1950s?

In [146]:
ra = cast.loc[(cast['year'] >= 1950) & (cast['year'] <= 1960)]
ra = ra.loc[lambda ra: ra['type'] == 'actress', :]
print(ra.shape[0], "roles were available for actresses")

63333 roles were available for actresses

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [151]:
cast.sort_values('year').head()

,title,year,name,type,character,n
2612704,Miss Jerry,1894,Blanche Bayliss,actress,Miss Geraldine Holbrook (Miss Jerry),NaN
482247,Miss Jerry,1894,William Courtenay,actor,Mr. Hamilton,NaN
576354,Miss Jerry,1894,Chauncey Depew,actor,Himself - the Director of the New York Central...,NaN
1782161,Soldiers of the Cross,1900,Reg Perry,actor,Lion,NaN
1782006,Soldiers of the Cross,1900,Orrie Perry,actor,Lion,NaN

In [153]:
lr = cast.loc[(cast['year'] >= 1894) & (cast['year'] <= 1980) & (cast['n'] == 1)]
print(lr.shape[0], "leading roles were available from beginning to 1980")

65140 leading roles were available from beginning to 1980

### How many non-leading roles were available through from the beginning of film history through 1980?

In [154]:
nlr = cast.loc[(cast['year'] >= 1894) & (cast['year'] <= 1980) & (cast['n'] != 1)]
print(nlr.shape[0], "non-leading roles were available from beginning to 1980")

1117667 non-leading roles were available from beginning to 1980

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [158]:
wlr = cast.loc[(cast['year'] >= 1894) & (cast['year'] <= 1980)]
print(wlr.isna().sum(), "\n\n\n")
print(wlr.isna().sum().sum(), "roles through 1980 were minor")

title             0
year              0
name              0
type              0
character         0
n            448347
dtype: int64



448347 roles through 1980 were minor